import React from "react";
import css from "./style.module.css";
import ETGHFile from "../../../assets/file/ETGH.pdf";

const data = [
  {
    filename:
      "Бакалаврын судалгааны ажлын үечилсэн төлөвлөгөөний загвар 2023-2024",
    desc: "2023-2024 оны БСА-Үечилсэн төлөвлөгөө",
    name: "М.Амарзаяа",
    date: "2023.09.10",
    downLink: ETGHFile,
  },
  {
    filename: "Handbook 05.12.2023 last.pdf",
    desc: "Оюутны гарын авлага",
    name: "Э.Саранцэцэг",
    date: "2023.05.12",
    downLink: ETGHFile,
  },
  {
    filename: "БСА 2023 Явц 2 хуваарь",
    desc: "2022-2023 оны хаврын улирлын БС-н Явц 2 -н хуваарь",
    name: "М.Амарзава",
    date: "2023.03.27",
    downLink: ETGHFile,
  },
  {
    filename:
      " Бакалаврын судалгааны үечилсэн телевлегеений загвар-2022-2023.doc ...",
    desc: "2023-2024 оны БСА-Үечилсэн төлөвлөгөө",
    name: "Э.Саранцэцэг",
    date: "2023.02.13",
    downLink: ETGHFile,
  },
  {
    filename: "Магистрын ЭШБЦ тооцох загвар CT.docx",
    desc: "2022 оны 11 сарын 18-ны дотор ЭШЕЦ тооцуулах материалаа. 34-211 тоот",
    name: "Э.Саранцэцэг",
    date: "2023.05.12",
    downLink: ETGHFile,
  },
  {
    filename: "БСА 2023 Явц 2 хуваарь",
    desc: "Сайн байцгаана уу 2022-2023 оны хичээлийн жилийн БСЛ сэдэв. 1. Сэдэв сонгож, сэдвийн багшаас зовшеврол удирдагч багштай хамтран телевлегее гаргана. 9 сарын 13-ны 14:00-18:00 цагийн хооронд 122 тоотод хураалгана уу. ( багшаасаа эвешверөл авалгүйгээр нерве телевлегее хийсэн оюутан байвал сэдэв буцаагдана) 2. БСА гүйцэтгэх хугацаа 2022 оны 9 сарын 12-оос 2022 оны 12 сарын 09 хүртэл 13 долоо хоног байна. Телевлегенд үг, үсгийн алдаа болон сарыг буруу бичсэн, кугацаа хоцорсон бол хураан",
    name: "М.Амарзава",
    date: "2023.03.27",
    downLink: ETGHFile,
  },
  {
    filename:
      "Бакалаврын судалгааны ажлын үечилсэн төлөвлөгөөний загвар 2023-2024",
    desc: "2023-2024 оны БСА-Үечилсэн төлөвлөгөө",
    name: "М.Амарзаяа",
    date: "2023.09.10",
    downLink: ETGHFile,
  },
  {
    filename: "Handbook 05.12.2023 last.pdf",
    desc: "Оюутны гарын авлага",
    name: "Э.Саранцэцэг",
    date: "2023.05.12",
    downLink: ETGHFile,
  },
  {
    filename: "БСА 2023 Явц 2 хуваарь",
    desc: "2022-2023 оны хаврын улирлын БС-н Явц 2 -н хуваарь",
    name: "М.Амарзава",
    date: "2023.03.27",
    downLink: ETGHFile,
  },
  {
    filename:
      " Бакалаврын судалгааны үечилсэн телевлегеений загвар-2022-2023.doc ...",
    desc: "2023-2024 оны БСА-Үечилсэн төлөвлөгөө",
    name: "Э.Саранцэцэг",
    date: "2023.02.13",
    downLink: ETGHFile,
  },
  {
    filename: "Магистрын ЭШБЦ тооцох загвар CT.docx",
    desc: "2022 оны 11 сарын 18-ны дотор ЭШЕЦ тооцуулах материалаа. 34-211 тоот",
    name: "Э.Саранцэцэг",
    date: "2023.05.12",
    downLink: ETGHFile,
  },
  {
    filename: "БСА 2023 Явц 2 хуваарь",
    desc: "Сайн байцгаана уу 2022-2023 оны хичээлийн жилийн БСЛ сэдэв. 1. Сэдэв сонгож, сэдвийн багшаас зовшеврол удирдагч багштай хамтран телевлегее гаргана. 9 сарын 13-ны 14:00-18:00 цагийн хооронд 122 тоотод хураалгана уу. ( багшаасаа эвешверөл авалгүйгээр нерве телевлегее хийсэн оюутан байвал сэдэв буцаагдана) 2. БСА гүйцэтгэх хугацаа 2022 оны 9 сарын 12-оос 2022 оны 12 сарын 09 хүртэл 13 долоо хоног байна. Телевлегенд үг, үсгийн алдаа болон сарыг буруу бичсэн, кугацаа хоцорсон бол хураан",
    name: "М.Амарзава",
    date: "2023.03.27",
    downLink: ETGHFile,
  },
];
const Table = () => {
  const handleDownload = (downLink) => {
    window.open(downLink, "_blank"); // Файлыг шинэ цонхоор нээх
  };

  return (
    <section>
      <table className={css.table}>
        <thead className={css.head}>
          <tr className={css.bagana}>
            <th>№</th>
            <th>Файлын нэр</th>
            <th>Тайлбар</th>
            <th>Оруулсан</th>
            <th>Огноо</th>
            <th>Үзэх</th>
          </tr>
        </thead>
        <tbody className={css.body}>
          {data.map((item, index) => (
            <tr key={index} className={css.bagana}>
              <td>{index + 1}</td>
              <td>{item.filename}</td>
              <td>{item.desc}</td>
              <td>{item.name}</td>
              <td>{item.date}</td>
              <td>
                <button
                  className={css.buttonsee}
                  onClick={() => handleDownload(item.downLink)}
                >
                  Файлаар харах
                </button>
              </td>
            </tr>
          ))}
        </tbody>
      </table>
    </section>
  );
};
export default Table;
